In [1]:
#Exploratory Data Analysis

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline 
sns.set(color_codes=True)

In [3]:
df=pd.read_csv(r"automobile.csv")
df.head(2)

,Unnamed: 0,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition
0,0,6300,toyota,cruiser,2008,clean vehicle,274117,black,jtezu11f88k007763,159348797,new jersey,usa,10 days left
1,1,2899,ford,se,2011,clean vehicle,190552,silver,2fmdk3gc4bbb02217,166951262,tennessee,usa,6 days left

In [4]:
df.tail(5)

,Unnamed: 0,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition
2494,2494,7800,nissan,versa,2019,clean vehicle,23609,red,3n1cn7ap9kl880319,167722715,california,usa,1 days left
2495,2495,9200,nissan,versa,2018,clean vehicle,34553,silver,3n1cn7ap5jl884088,167762225,florida,usa,21 hours left
2496,2496,9200,nissan,versa,2018,clean vehicle,31594,silver,3n1cn7ap9jl884191,167762226,florida,usa,21 hours left
2497,2497,9200,nissan,versa,2018,clean vehicle,32557,black,3n1cn7ap3jl883263,167762227,florida,usa,2 days left
2498,2498,9200,nissan,versa,2018,clean vehicle,31371,silver,3n1cn7ap4jl884311,167762228,florida,usa,21 hours left

In [5]:
df.dtypes

Unnamed: 0       int64
price            int64
brand           object
model           object
year             int64
title_status    object
mileage          int64
color           object
vin             object
lot              int64
state           object
country         object
condition       object
dtype: object

In [6]:
  df.rename(columns={"price":"Price","brand":"Brand","model":"Model","title_status":"Vehicle Status",
"year":"Year","color":"Color","state":"State","country":"Country","condition":"Condition","milage":"Milage"},inplace=True)
df.head(7)

,Unnamed: 0,Price,Brand,Model,Year,Vehicle Status,mileage,Color,vin,lot,State,Country,Condition
0,0,6300,toyota,cruiser,2008,clean vehicle,274117,black,jtezu11f88k007763,159348797,new jersey,usa,10 days left
1,1,2899,ford,se,2011,clean vehicle,190552,silver,2fmdk3gc4bbb02217,166951262,tennessee,usa,6 days left
2,2,5350,dodge,mpv,2018,clean vehicle,39590,silver,3c4pdcgg5jt346413,167655728,georgia,usa,2 days left
3,3,25000,ford,door,2014,clean vehicle,64146,blue,1ftfw1et4efc23745,167753855,virginia,usa,22 hours left
4,4,27700,chevrolet,1500,2018,clean vehicle,6654,red,3gcpcrec2jg473991,167763266,florida,usa,22 hours left
5,5,5700,dodge,mpv,2018,clean vehicle,45561,white,2c4rdgeg9jr237989,167655771,texas,usa,2 days left
6,6,7300,chevrolet,pk,2010,clean vehicle,149050,black,1gcsksea1az121133,167753872,georgia,usa,22 hours left

In [7]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\sanket singh\appdata\roaming\python\python312\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\sanket singh\appdata\roaming\python\python312\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\sanket singh\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\sanket singh\appdata\roaming\python\python312\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\sanket singh\appdata\roaming\python\python312\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\sanket singh\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [8]:
df=df.drop(['vin','lot'],axis=1)
df.head(3)

,Unnamed: 0,Price,Brand,Model,Year,Vehicle Status,mileage,Color,State,Country,Condition
0,0,6300,toyota,cruiser,2008,clean vehicle,274117,black,new jersey,usa,10 days left
1,1,2899,ford,se,2011,clean vehicle,190552,silver,tennessee,usa,6 days left
2,2,5350,dodge,mpv,2018,clean vehicle,39590,silver,georgia,usa,2 days left

In [9]:
print(df.isnull().sum())
df=df.dropna()
df.count()

Unnamed: 0        0
Price             0
Brand             0
Model             0
Year              0
Vehicle Status    0
mileage           0
Color             0
State             0
Country           0
Condition         0
dtype: int64

Unnamed: 0        2499
Price             2499
Brand             2499
Model             2499
Year              2499
Vehicle Status    2499
mileage           2499
Color             2499
State             2499
Country           2499
Condition         2499
dtype: int64

In [10]:
df.shape

(2499, 11)

In [11]:
df=df[df.duplicated()]
print("duplicate rows are :",df.shape)
df.count()

duplicate rows are : (0, 11)

Unnamed: 0        0
Price             0
Brand             0
Model             0
Year              0
Vehicle Status    0
mileage           0
Color             0
State             0
Country           0
Condition         0
dtype: int64

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      0 non-null      int64
 1   Price           0 non-null      int64
 2   Brand           0 non-null      object
 3   Model           0 non-null      object
 4   Year            0 non-null      int64
 5   Vehicle Status  0 non-null      object
 6   mileage         0 non-null      int64
 7   Color           0 non-null      object
 8   State           0 non-null      object
 9   Country         0 non-null      object
 10  Condition       0 non-null      object
dtypes: int64(4), object(7)
memory usage: 0.0+ bytes

In [17]:
df.describe

<bound method NDFrame.describe of Empty DataFrame
Columns: [Unnamed: 0, Price, Brand, Model, Year, Vehicle Status, mileage, Color, State, Country, Condition]
Index: []>